[
    {
      "title": "Welcome to College Chronicles",
      "slug": "welcome-to-college-chronicles",
      "date": "2024-12-06",
      "snippet": "Welcome to College Chronicles!",
      "content": "<p>Welcome to College Chronicles!</p> \n\nI'm Toba Banjo, and this is College Chronicles! Here you'll find a journal/blog type beat with my discoveries, recollections, and any wisdom I'm able to impart as I move forward with the admissions process. Hope you enjoy!",
      "image": "college-chronicles.png"
    },
    {
      "title": "Road to ACT",
      "slug": "road-to-act",
      "date": "2024-12-07",
      "snippet": "I'm taking the ACT next week- some tips and things to know.",
      "image": "act.png",
      "content": "<p>It's hard to believe, but I'm taking the ACT next Saturday...</p>\n<p>'Why aren't you doing the SAT?'</p>\n<p>'Why now? Don't most people wait until senior year?'</p>\n<p>'How can I prepare for the SAT?'</p>\n<p>All valid questions which I have to imagine might come up. I'm going to wait to really get into them until *after* my scores are out, just to sort of back that I know what I'm talking about. For now, I can say this: <b><i>Start studying now,</i></b> ESPECIALLY if you're currently taking a precalculus class. From what I know, you've pretty much seen the full extent of possible content for either test, and would do well to begin preparing as soon as possible for a spring first run.</p>\n<p> I'd say most people will be good with the SAT- if anyone cares for specifics, I'd be happy to get into more on why *I* chose the other path. Generally speaking, you'll want to take a full length practice test and begin to chip away at weaknesses. For specific tips, again, stay tuned for post-exam.</p>\n<p>As for why you should do it now?</p>\n<p>I feel like most people underestimate the sheer amount of preparatory tasks you're going to have to face in college applications. On top of essays, rec letters, and everything else, adding fall '25 tests to the pile is NOT a good idea.</p>\n<p>My recommendation would be to take a test at some point between now and the end of the school year (the next SAT is in March). Then, if you don't like your score, take another one during the summer and hopefully perform just as well if not better.</p>\n<p>I realize there might also be sophomores looking at the SAT advice from earlier- I think it's fair of me to assume that if you're already looking into testing in tenth grade, you're among the high achievers. Therefore, I take it you'll know to listen when I say <b>HOLD OFF</b> and wait until junior year. You have a significant amount of content to learn in Algebra II alone for the rest of the year, not even to talk of the precalc component. Plus, while English doesn't get that much more advanced, you'll pick up on a few things that should help you for the exam.</p>\n<p>(And if you're in tenth grade and taking <i>geometry</i> as your highest math course, you REALLY should not be starting to prep, given that you're even further 'behind'.)</p>\n<p>More than likely, you're just fine, you're on pace, and you're going to be okay. Keep up with everything asked of you for the rest of the school year- I think you can reasonably begin looking into things during rising junior summer if you'd like.</p>"
    }
  ]
  