[
    {
      "title": "Welcome to College Chronicles",
      "slug": "welcome-to-college-chronicles",
      "date": "2024-12-06",
      "snippet": "Welcome to College Chronicles!",
      "content": "<p>Welcome to College Chronicles!</p> \n\nI'm Toba Banjo, and this is College Chronicles! Here you'll find a journal/blog type beat with my discoveries, recollections, and any wisdom I'm able to impart as I move forward with the admissions process. Hope you enjoy!",
      "image": "college-chronicles.png"
    },
    {
      "title": "Road to ACT",
      "slug": "road-to-act",
      "date": "2024-12-07",
      "snippet": "I'm taking the ACT next week- some tips and things to know.",
      "image": "act.png",
      "content": "<p>It's hard to believe, but I'm taking the ACT next Saturday...</p>\n<p>'Why aren't you doing the SAT?'</p>\n<p>'Why now? Don't most people wait until senior year?'</p>\n<p>'How can I prepare for the SAT?'</p>\n<p>All valid questions which I have to imagine might come up. I'm going to wait to really get into them until *after* my scores are out, just to sort of back that I know what I'm talking about. For now, I can say this: <b><i>Start studying now,</i></b> ESPECIALLY if you're currently taking a precalculus class. From what I know, you've pretty much seen the full extent of possible content for either test, and would do well to begin preparing as soon as possible for a spring first run.</p>\n<p> I'd say most people will be good with the SAT- if anyone cares for specifics, I'd be happy to get into more on why *I* chose the other path. Generally speaking, you'll want to take a full length practice test and begin to chip away at weaknesses. For specific tips, again, stay tuned for post-exam.</p>\n<p>As for why you should do it now?</p>\n<p>I feel like most people underestimate the sheer amount of preparatory tasks you're going to have to face in college applications. On top of essays, rec letters, and everything else, adding fall '25 tests to the pile is NOT a good idea.</p>\n<p>My recommendation would be to take a test at some point between now and the end of the school year (the next SAT is in March). Then, if you don't like your score, take another one during the summer and hopefully perform just as well if not better.</p>\n<p>I realize there might also be sophomores looking at the SAT advice from earlier- I think it's fair of me to assume that if you're already looking into testing in tenth grade, you're among the high achievers. Therefore, I take it you'll know to listen when I say <b>HOLD OFF</b> and wait until junior year. You have a significant amount of content to learn in Algebra II alone for the rest of the year, not even to talk of the precalc component. Plus, while English doesn't get that much more advanced, you'll pick up on a few things that should help you for the exam.</p>\n<p>(And if you're in tenth grade and taking <i>geometry</i> as your highest math course, you REALLY should not be starting to prep, given that you're even further 'behind'.)</p>\n<p>More than likely, you're just fine, you're on pace, and you're going to be okay. Keep up with everything asked of you for the rest of the school year- I think you can reasonably begin looking into things during rising junior summer if you'd like.</p>"
    },
    {
      "title": "Beginning to Navigate College Selection",
      "slug": "navigate-college",
      "date": "2024-12-09",
      "snippet": "There are thousands of great schools in the United States. How do you narrow down your choices?",
      "image": "collegesearch.png",
      "content": "Just days ago, I began my first dive into the world of college selection, and to my surprise, it's actually not been so bad. With a major in mind, a list of relevant criteria on hand, and the Fiske Guide by my side, I managed to cut down what was originally about 200 schools to just around 20.\n<p>So how did I do it?</p>\n<p>It's actually surprisingly simple.</p>\nFirst of all, something to get out of the way: I'm well aware that the vast majority of college-hopefuls <b>do not know what they're going to major in at this point in their high school career.</b> Personally, I think that's just fine. I'm a bit different in the sense that, for as long as I've been able to put my fingers to the keyboard, I've been dead set on entering into computer science. Nothing's quite tickled my brain the same way since- as a result, I had the distinct advantage of being able to work my way down as opposed to building my way up. By that, I mean if you're unsure about what you intend to study, you might be better off doing a bit more research and making some choices yourself as opposed to starting by breaking up a T200 list like I did.\n<p>However, if you <i>do</i> have a major in mind, things get a lot easier. My first step was to open up <a href='https://www.usnews.com/best-colleges'>US News and World Report</a>; over there, I'd find their top CS schools and dump the majority into a Google Sheet. Then, the real fun began. I knew from the get go that it would be impossible to start looking into where I wanted to go if I had dozens and dozens of schools to choose from. That meant it was time to start contemplating what I really wanted in a college.</p>\n<p>Other than some gut removals, the schools I decided to remove were largely due to falling short in one of the following categories: <b>political differences, diversity, pricing, prestige, and population / proximity</b>. I'll briefly go into each.</p>\n<h3>Political Differences</h3>\n<p>As far as these are concerned, I understand things aren't quite black and white when it comes to the electoral map. At the same time, there are some pretty blatant disagreements across political lines which I came to realize I'd rather avoid in dedicating four years of my life to a given school. I was able to solidly eliminate close to 40 or 50% of the list by looking at harsh per-state deviance from my broader views and beliefs.\n<h3>Diversity</h3>\n<p>My feelings about this one could be due to my standing as an African-American, or not, I don't really know. Either way, I figured that, given the choice, I'd prefer to be surrounded by a mix of people from different backgrounds and cultures. Once again referring back to the US News & World Report, I began to add a diversity index to my spreadsheet. In essence, their system is a 0-1 scale with 0 meaning no diversity and 1 pointing to the most diverse. The highest ranking I saw across all US schools was 0.77; therefore, I thought it would make sense to cut any which fell below 0.6. This category probably had fewer cuts compared to some of the others, but helped to pretty easily rule out schools where I'd feel like an extreme outlier. The flip side could be weird, too; constantly surrounding myself with people just like me could get old pretty fast.\n<h3>Pricing</h3>\n<p>I'm probably going to make a whole article about financial dealings closer to actually beginning applications; they're a whole beast of their own. Essentially, with help from the <a href='https://www.amazon.com/Fiske-Guide-Colleges-2025-Edward/dp/1728295556'>Fiske Guide's</a> price and debt index, I raised a bit of an eyebrow to some colleges and cut off a <i>few</i> while still leaving my options open. I've barely begun looking into scholarships and financial aid, so this was another not-quite-huge contributor to narrowing down my list.</p>\n<h3>Prestige</h3>\n<p>This one was pretty straightforward. If you'll excuse me for sounding a bit full of it, I think my work ethic and accomplishments as a student lend themselves to reputable, meaningful education in the future. If any of the schools that were left fell out of or a little too close to the bottom T100 for CS, I cut them without too many regrets.\n<h3>Population / Proximity</h3>\nWith all the other criteria out of the way, there were only about 40 schools left. My final requirement had to do with A) physical distance to home and B) the size of the student body. Unsurprisingly, most of the best CS schools are in or around New England, so I didn't have <i>that</i> much more work when it came to location. I was still able to chop off a bit more like those that were, say, halfway across the country. I'm not terribly fond of needing more than a few hours in flight to return to my loved ones.</p>\n<p>Last but certainly not least, I think I'm a little more in favor of smaller schools. The potential of drowning as a pin in a haystack or missing the chance to meaningfully interact with my teachers is just a LITTLE too intimidating for me to go beyond, really, 25K or so students.\n<p>With all that sorting out of the way, I was done- eighteen schools. Earlier, I mentioned how the real fun began, but in reality, I think I'm just getting started. Now that I've established a solid number of schools from a selection of hundreds, I'll need to begin the much longer process of research, touring, and really getting my hands dirty with where I want to go. It'll be a lot of work, but I'm just glad I got the hardest part over with.</p>\n<p>Oh, and here's the list if you're curious: Boston University, Carnegie Mellon University, Cornell University, Dartmouth College, Drexel University, George Washington University, Harvard University, Massachusetts Institute of Technology, Northwestern University, Princeton University, Rutgers University, Stony Brook University, University at Buffalo, University of Chicago, University of Maryland - Baltimore County, University of Pennsylvania, University of Virginia."
    },
    {
      "title": "Organize, Organize, Organize",
      "slug": "organize-organize",
      "date": "2024-12-13",
      "snippet": "You've got to organize, organize, organize!",
      "image": "excelsheet.png",
      "content": "<p>Did you get that? No? One more time for the people in the back- <b>organize, organize, organize.</b></p>\n<p>One of the most crucial parts of the college application process is making sure that you have easy access to a plethora of information at any given moment. You will need to continuously reference everything from extracurriculars to family education to financial data as you work your way through several applications, so it’s important to make sure that you have everything you need and where to find it laid out.</p>\n<p>Different strategies work better for different people; as you might've come to realize by now, I’m pretty much obsessed with spreadsheets, so just about everything I do for sorting my college data revolves around Google Sheets. I love being able to sort and filter through relevant categories with ease, but I understand this approach might not be for everyone and can come off as a bit overwhelming. You might prefer to get a notebook to write everything and to keep it in a place you’ll remember. It’s understandable if you might have to bounce between mediums to try and find what works best, but once you’ve landed on something, do your best to stick with it.</p>\n<p>In terms of what you should actually be writing down, there’s a lot, especially if you’re more involved with extracurriculars. Yet as far as I can tell, there’s really no downside to sorting through the tedium early, so why not get a head start? Courtesy of the <a href='https://www.amazon.com/College-Bound-Organizer-Successful-Applications/dp/1633536831'>College Bound Organizer</a>, here is what I have determined as necessary to record for easy reference and copying:<ul><li><b>Parent/guardian education history</b> (undergraduate, graduate. What schools? When did they graduate?)</li><li><b>High school information</b> (address, counselor and their contact information)</li><li><b>Extracurriculars</b> (roles, length, brief description)</li><li><b>Community service involvements</b> (responsibilities, length of time, brief description)</li><li><b>Jobs</b> (occupation, length of time, brief description)</li><li><b>Summer experiences</b> (internships, pre-college prep programs, and anything else of that nature)</li><li><b>Sports</b> (teams, length of time, position, stats if applicable, other responsibilities within those sports, brief description)</li></ul>\n<p>You don’t need to go too crazy—save the energy for the essays—but storing these basic aspects of your high school career should help tremendously when you go to start filling out your applications.</p>\n<p>In addition, I would highly recommend starting <b>two separate emails</b>- one for <u>completing college applications</u> (including FAFSA and other related programs), and one for <u>applying to / receiving scholarships.</u> Use a professional handle- firstnamelastname.college@gmail.com, for example, and begin to get into a habit of checking these emails regularly. All these different emails might seem like a lot of work, but it <b>ensures the most important information is separated from the rest of your inbox.</b> If you’d like, you can also store all your essays, notes, and/or spreadsheets on your college applications account, just so that finding them when needed is relatively straightforward. Make sure you’re keeping track of your logins and passwords across different websites as well!"
    }
  ]
  